from django import template
register = template.Library()
mat_words = ['сука', 'суки', 'сукой', 'суке', 'суку',
             'сук', 'суками', 'сукам',
             'мудак', 'мудака', 'мудаку', 'мудаком', 'мудаке',
             'мудаки', 'мудаков', 'мудакам', 'мудаками', 'мудаках',
             'дебил', 'дебила', 'дебилом', 'дебилу', 'дебиле',
             'дебилы', 'дебилов', 'дебилами', 'дебилам', 'дебилах',
             'ублюдок', 'ублюдка', 'ублюдком', 'ублюдку', 'ублюдке',
             'ублюдки', 'ублюдков', 'ублюдками', 'ублюдкам', 'ублюдках'
             'говно', 'говна', 'говном', 'говну', 'говне',
             'урод', 'урода', 'уродом', 'уроду', 'уроде'
             'уроды', 'уродов', 'уродами', 'уродам', 'уродах']

@register.filter()
def cenzor(user_text):
    for i in user_text.split():
        if i in mat_words:
            user_text = user_text.replace(i, f'{i[0]}...')
    return(user_text)
